---
kind: type
id: T:Autodesk.Revit.DB.Visual.Metal
source: html/618a6255-d79c-e405-6804-994c56317dc4.htm
---
# Autodesk.Revit.DB.Visual.Metal

A static class that provides access to the property names that appear in the Metal visual asset schema.

## Syntax (C#)
```csharp
public static class Metal
```